{
  "nodes": [
    {
      "op": "null", 
      "name": "Placeholder", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "pad0_NCHW3c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_reshape_transpose_pad___layout_transform__", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "transpose1_OIHW3i8o", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "_contrib_conv2d_nchwc0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batch_normalization/FusedBatchNorm_gamma_mul_div", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_normalization/FusedBatchNorm_add_beta", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "Relu", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___transpose_broadcast_mul_broadcast_add_relu", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "pad2_NCHW8c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_transpose_pad___layout_transform__", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[6, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "transpose7_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "_contrib_conv2d_nchwc1", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[7, 0, 0], [8, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batch_normalization_1/FusedBatchNorm_gamma_mul_div", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_normalization_1/FusedBatchNorm_add_beta", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "pad3_NCHW8c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___transpose_broadcast_mul_broadcast_add_relu_transpose_pad___layout_transform__", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[9, 0, 0], [10, 0, 0], [11, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "transpose10_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "_contrib_conv2d_nchwc2", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "pad1_NCHW8c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_transpose_pad___layout_transform___1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[6, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "transpose4_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "_contrib_conv2d_nchwc3", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_2", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[15, 0, 0], [16, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "broadcast_add0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___transpose___layout_transform___transpose_broadcast_add", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[14, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batch_normalization_2/FusedBatchNorm_gamma_mul_div", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_normalization_2/FusedBatchNorm_add_beta", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "pad4_NCHW8c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_mul_broadcast_add_relu_transpose_pad___layout_transform__", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[18, 0, 0], [19, 0, 0], [20, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "transpose13_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "_contrib_conv2d_nchwc4", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batch_normalization_3/FusedBatchNorm_gamma_mul_div", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_normalization_3/FusedBatchNorm_add_beta", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "pad5_NCHW8c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___transpose_broadcast_mul_broadcast_add_relu_transpose_pad___layout_transform__", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[23, 0, 0], [24, 0, 0], [25, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "transpose16_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "_contrib_conv2d_nchwc5", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "broadcast_add1", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___transpose_broadcast_add", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[28, 0, 0], [18, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batch_normalization_4/FusedBatchNorm_gamma_mul_div", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_normalization_4/FusedBatchNorm_add_beta", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "pad6_NCHW8c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_mul_broadcast_add_relu_transpose_pad___layout_transform__", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[29, 0, 0], [30, 0, 0], [31, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "transpose19_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "_contrib_conv2d_nchwc6", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[32, 0, 0], [33, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batch_normalization_5/FusedBatchNorm_gamma_mul_div", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_normalization_5/FusedBatchNorm_add_beta", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "pad7_NCHW8c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___transpose_broadcast_mul_broadcast_add_relu_transpose_pad___layout_transform__", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[34, 0, 0], [35, 0, 0], [36, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "transpose22_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "_contrib_conv2d_nchwc7", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[37, 0, 0], [38, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "broadcast_add2", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___transpose_broadcast_add", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[39, 0, 0], [29, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batch_normalization_6/FusedBatchNorm_gamma_mul_div", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_normalization_6/FusedBatchNorm_add_beta", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "pad8_NCHW8c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_mul_broadcast_add_relu_transpose_pad___layout_transform__", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[40, 0, 0], [41, 0, 0], [42, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "transpose25_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "_contrib_conv2d_nchwc8", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[43, 0, 0], [44, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batch_normalization_7/FusedBatchNorm_gamma_mul_div", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_normalization_7/FusedBatchNorm_add_beta", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "pad9_NCHW8c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___transpose_broadcast_mul_broadcast_add_relu_transpose_pad___layout_transform__", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[45, 0, 0], [46, 0, 0], [47, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "transpose28_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "_contrib_conv2d_nchwc9", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[48, 0, 0], [49, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "broadcast_add3", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___transpose_broadcast_add", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[50, 0, 0], [40, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batch_normalization_8/FusedBatchNorm_gamma_mul_div", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_normalization_8/FusedBatchNorm_add_beta", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "pad10_NCHW8c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_mul_broadcast_add_relu_transpose_pad___layout_transform__", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[51, 0, 0], [52, 0, 0], [53, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "transpose31_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "_contrib_conv2d_nchwc10", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[54, 0, 0], [55, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batch_normalization_9/FusedBatchNorm_gamma_mul_div", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_normalization_9/FusedBatchNorm_add_beta", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "pad11_NCHW8c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___transpose_broadcast_mul_broadcast_add_relu_transpose_pad___layout_transform__", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[56, 0, 0], [57, 0, 0], [58, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "transpose34_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "_contrib_conv2d_nchwc11", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[59, 0, 0], [60, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batch_normalization_10/FusedBatchNorm_gamma_mul_div", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_normalization_10/FusedBatchNorm_add_beta", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "Relu_10", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___transpose_broadcast_add_broadcast_mul_broadcast_add_relu", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[61, 0, 0], [51, 0, 0], [62, 0, 0], [63, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "transpose39_NCHW8c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_pad_transpose___layout_transform__", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[64, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "transpose40_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "_contrib_conv2d_nchwc12", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_3", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[65, 0, 0], [66, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batch_normalization_11/FusedBatchNorm_gamma_mul_div", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_normalization_11/FusedBatchNorm_add_beta", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "pad12_NCHW8c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___transpose_broadcast_mul_broadcast_add_relu_transpose_pad___layout_transform___1", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[67, 0, 0], [68, 0, 0], [69, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "transpose43_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "_contrib_conv2d_nchwc13", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_4", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[70, 0, 0], [71, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "transpose36_NCHW8c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_pad_transpose___layout_transform___1", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[64, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "transpose37_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "_contrib_conv2d_nchwc14", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_5", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[73, 0, 0], [74, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "broadcast_add5", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___transpose___layout_transform___transpose_broadcast_add_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[72, 0, 0], [75, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batch_normalization_12/FusedBatchNorm_gamma_mul_div", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_normalization_12/FusedBatchNorm_add_beta", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "pad13_NCHW8c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_mul_broadcast_add_relu_transpose_pad___layout_transform___1", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[76, 0, 0], [77, 0, 0], [78, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "transpose46_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "_contrib_conv2d_nchwc15", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_4", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[79, 0, 0], [80, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batch_normalization_13/FusedBatchNorm_gamma_mul_div", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_normalization_13/FusedBatchNorm_add_beta", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "pad14_NCHW8c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___transpose_broadcast_mul_broadcast_add_relu_transpose_pad___layout_transform___1", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[81, 0, 0], [82, 0, 0], [83, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "transpose49_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "_contrib_conv2d_nchwc16", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_4", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[84, 0, 0], [85, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "broadcast_add6", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___transpose_broadcast_add_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[86, 0, 0], [76, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batch_normalization_14/FusedBatchNorm_gamma_mul_div", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_normalization_14/FusedBatchNorm_add_beta", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "pad15_NCHW8c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_mul_broadcast_add_relu_transpose_pad___layout_transform___1", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[87, 0, 0], [88, 0, 0], [89, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "transpose52_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "_contrib_conv2d_nchwc17", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_4", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[90, 0, 0], [91, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batch_normalization_15/FusedBatchNorm_gamma_mul_div", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_normalization_15/FusedBatchNorm_add_beta", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "pad16_NCHW8c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___transpose_broadcast_mul_broadcast_add_relu_transpose_pad___layout_transform___1", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[92, 0, 0], [93, 0, 0], [94, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "transpose55_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "_contrib_conv2d_nchwc18", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_4", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[95, 0, 0], [96, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "broadcast_add7", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___transpose_broadcast_add_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[97, 0, 0], [87, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batch_normalization_16/FusedBatchNorm_gamma_mul_div", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_normalization_16/FusedBatchNorm_add_beta", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "pad17_NCHW8c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_mul_broadcast_add_relu_transpose_pad___layout_transform___1", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[98, 0, 0], [99, 0, 0], [100, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "transpose58_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "_contrib_conv2d_nchwc19", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_4", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[101, 0, 0], [102, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batch_normalization_17/FusedBatchNorm_gamma_mul_div", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_normalization_17/FusedBatchNorm_add_beta", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "pad18_NCHW8c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___transpose_broadcast_mul_broadcast_add_relu_transpose_pad___layout_transform___1", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[103, 0, 0], [104, 0, 0], [105, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "transpose61_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "_contrib_conv2d_nchwc20", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_4", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[106, 0, 0], [107, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "broadcast_add8", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___transpose_broadcast_add_1", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[108, 0, 0], [98, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batch_normalization_18/FusedBatchNorm_gamma_mul_div", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_normalization_18/FusedBatchNorm_add_beta", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "pad19_NCHW8c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_mul_broadcast_add_relu_transpose_pad___layout_transform___1", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[109, 0, 0], [110, 0, 0], [111, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "transpose64_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "_contrib_conv2d_nchwc21", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_4", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[112, 0, 0], [113, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batch_normalization_19/FusedBatchNorm_gamma_mul_div", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_normalization_19/FusedBatchNorm_add_beta", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "pad20_NCHW8c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___transpose_broadcast_mul_broadcast_add_relu_transpose_pad___layout_transform___1", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[114, 0, 0], [115, 0, 0], [116, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "transpose67_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "_contrib_conv2d_nchwc22", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_4", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[117, 0, 0], [118, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batch_normalization_20/FusedBatchNorm_gamma_mul_div", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_normalization_20/FusedBatchNorm_add_beta", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "Relu_20", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___transpose_broadcast_add_broadcast_mul_broadcast_add_relu_1", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[119, 0, 0], [109, 0, 0], [120, 0, 0], [121, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "transpose72_NCHW8c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_pad_transpose___layout_transform___2", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[122, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "transpose73_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "_contrib_conv2d_nchwc23", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_6", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[123, 0, 0], [124, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batch_normalization_21/FusedBatchNorm_gamma_mul_div", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_normalization_21/FusedBatchNorm_add_beta", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "pad21_NCHW8c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___transpose_broadcast_mul_broadcast_add_relu_transpose_pad___layout_transform___2", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[125, 0, 0], [126, 0, 0], [127, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "transpose76_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "_contrib_conv2d_nchwc24", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_7", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[128, 0, 0], [129, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "transpose69_NCHW8c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_pad_transpose___layout_transform___3", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[122, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "transpose70_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "_contrib_conv2d_nchwc25", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_8", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[131, 0, 0], [132, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "broadcast_add10", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___transpose___layout_transform___transpose_broadcast_add_2", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[130, 0, 0], [133, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batch_normalization_22/FusedBatchNorm_gamma_mul_div", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_normalization_22/FusedBatchNorm_add_beta", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "pad22_NCHW8c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_mul_broadcast_add_relu_transpose_pad___layout_transform___2", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[134, 0, 0], [135, 0, 0], [136, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "transpose79_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "_contrib_conv2d_nchwc26", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_7", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[137, 0, 0], [138, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batch_normalization_23/FusedBatchNorm_gamma_mul_div", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_normalization_23/FusedBatchNorm_add_beta", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "pad23_NCHW8c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___transpose_broadcast_mul_broadcast_add_relu_transpose_pad___layout_transform___2", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[139, 0, 0], [140, 0, 0], [141, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "transpose82_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "_contrib_conv2d_nchwc27", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_7", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[142, 0, 0], [143, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "broadcast_add11", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___transpose_broadcast_add_2", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[144, 0, 0], [134, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batch_normalization_24/FusedBatchNorm_gamma_mul_div", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_normalization_24/FusedBatchNorm_add_beta", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "pad24_NCHW8c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_mul_broadcast_add_relu_transpose_pad___layout_transform___2", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[145, 0, 0], [146, 0, 0], [147, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "transpose85_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "_contrib_conv2d_nchwc28", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_7", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[148, 0, 0], [149, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batch_normalization_25/FusedBatchNorm_gamma_mul_div", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_normalization_25/FusedBatchNorm_add_beta", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "pad25_NCHW8c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___transpose_broadcast_mul_broadcast_add_relu_transpose_pad___layout_transform___2", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[150, 0, 0], [151, 0, 0], [152, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "transpose88_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "_contrib_conv2d_nchwc29", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_7", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[153, 0, 0], [154, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "broadcast_add12", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___transpose_broadcast_add_2", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[155, 0, 0], [145, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batch_normalization_26/FusedBatchNorm_gamma_mul_div", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_normalization_26/FusedBatchNorm_add_beta", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "pad26_NCHW8c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_mul_broadcast_add_relu_transpose_pad___layout_transform___2", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[156, 0, 0], [157, 0, 0], [158, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "transpose91_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "_contrib_conv2d_nchwc30", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_7", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[159, 0, 0], [160, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batch_normalization_27/FusedBatchNorm_gamma_mul_div", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_normalization_27/FusedBatchNorm_add_beta", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "pad27_NCHW8c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___transpose_broadcast_mul_broadcast_add_relu_transpose_pad___layout_transform___2", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[161, 0, 0], [162, 0, 0], [163, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "transpose94_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "_contrib_conv2d_nchwc31", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_7", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[164, 0, 0], [165, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "broadcast_add13", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___transpose_broadcast_add_2", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[166, 0, 0], [156, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batch_normalization_28/FusedBatchNorm_gamma_mul_div", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_normalization_28/FusedBatchNorm_add_beta", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "pad28_NCHW8c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_broadcast_mul_broadcast_add_relu_transpose_pad___layout_transform___2", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[167, 0, 0], [168, 0, 0], [169, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "transpose97_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "_contrib_conv2d_nchwc32", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_7", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[170, 0, 0], [171, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batch_normalization_29/FusedBatchNorm_gamma_mul_div", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_normalization_29/FusedBatchNorm_add_beta", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "pad29_NCHW8c", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___transpose_broadcast_mul_broadcast_add_relu_transpose_pad___layout_transform___2", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[172, 0, 0], [173, 0, 0], [174, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "transpose100_OIHW8i8o", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "_contrib_conv2d_nchwc33", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse__contrib_conv2d_NCHWc_7", 
        "num_inputs": "2", 
        "num_outputs": "1"
      }, 
      "inputs": [[175, 0, 0], [176, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batch_normalization_30/FusedBatchNorm_gamma_mul_div", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_normalization_30/FusedBatchNorm_add_beta", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "transpose102", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse___layout_transform___transpose_broadcast_add_broadcast_mul_broadcast_add_relu_transpose", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[177, 0, 0], [167, 0, 0], [178, 0, 0], [179, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "average_pooling2d/AvgPool", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_avg_pool2d", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[180, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "Reshape_1", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_transpose_reshape", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[181, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "transpose104", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "dense/bias", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "broadcast_add15", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_dense_broadcast_add", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[182, 0, 0], [183, 0, 0], [184, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "flatten0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_flatten", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[185, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "softmax_tensor", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_softmax", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[186, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    2, 
    4, 
    5, 
    8, 
    10, 
    11, 
    13, 
    16, 
    19, 
    20, 
    22, 
    24, 
    25, 
    27, 
    30, 
    31, 
    33, 
    35, 
    36, 
    38, 
    41, 
    42, 
    44, 
    46, 
    47, 
    49, 
    52, 
    53, 
    55, 
    57, 
    58, 
    60, 
    62, 
    63, 
    66, 
    68, 
    69, 
    71, 
    74, 
    77, 
    78, 
    80, 
    82, 
    83, 
    85, 
    88, 
    89, 
    91, 
    93, 
    94, 
    96, 
    99, 
    100, 
    102, 
    104, 
    105, 
    107, 
    110, 
    111, 
    113, 
    115, 
    116, 
    118, 
    120, 
    121, 
    124, 
    126, 
    127, 
    129, 
    132, 
    135, 
    136, 
    138, 
    140, 
    141, 
    143, 
    146, 
    147, 
    149, 
    151, 
    152, 
    154, 
    157, 
    158, 
    160, 
    162, 
    163, 
    165, 
    168, 
    169, 
    171, 
    173, 
    174, 
    176, 
    178, 
    179, 
    183, 
    184
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    43, 
    44, 
    45, 
    46, 
    47, 
    48, 
    49, 
    50, 
    51, 
    52, 
    53, 
    54, 
    55, 
    56, 
    57, 
    58, 
    59, 
    60, 
    61, 
    62, 
    63, 
    64, 
    65, 
    66, 
    67, 
    68, 
    69, 
    70, 
    71, 
    72, 
    73, 
    74, 
    75, 
    76, 
    77, 
    78, 
    79, 
    80, 
    81, 
    82, 
    83, 
    84, 
    85, 
    86, 
    87, 
    88, 
    89, 
    90, 
    91, 
    92, 
    93, 
    94, 
    95, 
    96, 
    97, 
    98, 
    99, 
    100, 
    101, 
    102, 
    103, 
    104, 
    105, 
    106, 
    107, 
    108, 
    109, 
    110, 
    111, 
    112, 
    113, 
    114, 
    115, 
    116, 
    117, 
    118, 
    119, 
    120, 
    121, 
    122, 
    123, 
    124, 
    125, 
    126, 
    127, 
    128, 
    129, 
    130, 
    131, 
    132, 
    133, 
    134, 
    135, 
    136, 
    137, 
    138, 
    139, 
    140, 
    141, 
    142, 
    143, 
    144, 
    145, 
    146, 
    147, 
    148, 
    149, 
    150, 
    151, 
    152, 
    153, 
    154, 
    155, 
    156, 
    157, 
    158, 
    159, 
    160, 
    161, 
    162, 
    163, 
    164, 
    165, 
    166, 
    167, 
    168, 
    169, 
    170, 
    171, 
    172, 
    173, 
    174, 
    175, 
    176, 
    177, 
    178, 
    179, 
    180, 
    181, 
    182, 
    183, 
    184, 
    185, 
    186, 
    187, 
    188
  ], 
  "heads": [[187, 0, 0]], 
  "attrs": {
    "storage_id": ["list_int", [
        5, 
        0, 
        6, 
        1, 
        7, 
        8, 
        0, 
        1, 
        9, 
        2, 
        10, 
        11, 
        1, 
        12, 
        2, 
        1, 
        13, 
        0, 
        1, 
        14, 
        15, 
        0, 
        16, 
        2, 
        17, 
        18, 
        0, 
        19, 
        2, 
        0, 
        20, 
        21, 
        1, 
        22, 
        2, 
        23, 
        24, 
        1, 
        25, 
        2, 
        1, 
        26, 
        27, 
        0, 
        28, 
        2, 
        29, 
        30, 
        0, 
        31, 
        2, 
        0, 
        32, 
        33, 
        1, 
        34, 
        2, 
        35, 
        36, 
        1, 
        37, 
        2, 
        38, 
        39, 
        1, 
        0, 
        40, 
        2, 
        41, 
        42, 
        0, 
        43, 
        2, 
        0, 
        44, 
        1, 
        0, 
        45, 
        46, 
        2, 
        47, 
        1, 
        48, 
        49, 
        2, 
        50, 
        1, 
        2, 
        51, 
        52, 
        1, 
        53, 
        0, 
        54, 
        55, 
        1, 
        56, 
        0, 
        1, 
        57, 
        58, 
        2, 
        59, 
        0, 
        60, 
        61, 
        2, 
        62, 
        0, 
        2, 
        63, 
        64, 
        0, 
        65, 
        1, 
        66, 
        67, 
        0, 
        68, 
        1, 
        69, 
        70, 
        0, 
        2, 
        71, 
        1, 
        72, 
        73, 
        2, 
        74, 
        1, 
        2, 
        75, 
        0, 
        2, 
        76, 
        77, 
        1, 
        78, 
        0, 
        79, 
        80, 
        1, 
        81, 
        0, 
        1, 
        82, 
        83, 
        2, 
        84, 
        0, 
        85, 
        86, 
        2, 
        87, 
        0, 
        2, 
        88, 
        89, 
        0, 
        90, 
        1, 
        91, 
        92, 
        0, 
        93, 
        1, 
        0, 
        94, 
        95, 
        2, 
        96, 
        1, 
        97, 
        98, 
        2, 
        99, 
        1, 
        100, 
        101, 
        2, 
        3, 
        4, 
        102, 
        103, 
        3, 
        4, 
        3]], 
    "dltype": ["list_str", [
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32"]], 
    "dtype": ["list_int", [
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0]], 
    "shape": ["list_shape", [
        [1, 32, 32, 3], 
        [1, 1, 34, 34, 3], 
        [2, 1, 3, 3, 3, 8], 
        [1, 2, 32, 32, 8], 
        [16], 
        [16], 
        [1, 32, 32, 16], 
        [1, 2, 34, 34, 8], 
        [2, 2, 3, 3, 8, 8], 
